package com.company.fundamental;

/** implements
 * а интерфейс — реализуется (implements)
 * интерфейс - набор сигнатур метода
 * реализовать интерфейсов — сколько угодно
 * Можно считать, что любой интерфейс — это уже абстрактный класс, но не наоборот.
 *Интерфейс может наследовать (extends) другой интерфейс/интерфейсы
 *
 *Абстрактные классы используются, когда есть отношение "is-a", то есть класс-наследник расширяет базовый
 *  абстрактный класс, а интерфейсы могут быть реализованы разными классами, вовсе не связанными друг с другом.
 *
 *Используйте интерфейсы, если:
 * Вы ожидаете, что несвязанные классы будут реализовывать ваш интерфейс. Например, интерфейсы Comparable
 * и Cloneable реализуются многими несвязанными классами.
 *
 * Вы хотите определить поведение конкретного типа данных, но вам не важно, кто его реализует.
 *
 * Вы хотите использовать множественное наследование типа.
 *
 *  Все объявленные внутри интерфейса в языке Java методы – по умолчанию абстрактные
 *
 * */

public interface MyInterface {



}

